x <- c(1,2,3)
mean(x)
max(x)
min(x)

#Q1
score <- c(80, 60, 70, 50, 90)
#Q2
mean(score)

#복습 1
var1 <- c (1,2,3,4,5,6,7,8,9,10)
var2 <- c (1:10)
var3 <- seq(1,10)
var_mean <- mean(var1)
var_max <- max(var1)
var_min <- min(var1)
# return : 함수를 정의하는 구문을 즉시 끝내고 출력 값x을 반환하고, 이 반환값은 output으로써의 동작을 하여 다른 함수와의 합성함수를 비롯해 여러 연산에서 쓰일 수 있다. 함수의 리턴값은 오로지 1개만 줄 수 있다. 
# print(x) : x를 출력하라. 여러 번 사용 가능, 하지만 함수의 output값이 아니라 엄밀한 문법상 계산을 수행할 수는 없음.
# scan : (콘솔창에서) 사용자로부터 입력값을 받아라. 
# paste : 숫자, 변수, 문자 등을 받아 하나의 문자열로 취합
